//Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
//3, 5 -> 243 (3⁵)
//2, 4 -> 16

int a = 3;
int b = 5;
int a1 = 2;
int b1 = 4;
Console.WriteLine("3^5 = " + Math.Pow(a, b));
Console.WriteLine("2^4 = " + Math.Pow(a1, b1));

