// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
//4 -> да
//-3 -> нет
//7 -> нет

double a = 4; 
double b = -3;        
double c = 7; 

if (a % 2 == 0) Console.WriteLine("Четное");
else Console.WriteLine( "Не четное ");
if (b % 2 == 0) Console.WriteLine("Четное" );
else Console.WriteLine("Не четное ");
if (c % 2 == 0) Console.WriteLine("Четное" );
else Console.WriteLine("Не четное");
