//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8

int [] array = {1, 2, 3, 4, 5};
int n = array.Length;
int index = 0;
while (index < n)
{
index = index + 1;
}
if (n % 2== 0) Console.WriteLine (n);
