//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8

for (int i = 2; i <= 5; i += 2) Console.WriteLine(i);
for (int i = 2; i <= 8; i += 2) Console.WriteLine(i);

